print("Пожалуйста, укажите:")
print("вид вашего питомца")
default1 = input()
print("его кличку")
default2 = input()
print("его возраст")
default3 = int(input())
print("имя владельца")
default4 = input()

pets = {
'мой питомец': {
'вид':default1,
'кличка':default2,
'возраст':default3,
'владелец':default4
}
}

a = pets['мой питомец']['возраст']
if a == 1 or a == 11 or a == 21 or a == 31 or a == 41 or a == 51 or a == 61 or a == 71 or a == 81 or a == 91 or a == 101:
    print("Это", pets['мой питомец']['вид'], "по кличке", '"', pets['мой питомец']['кличка'], '".', "Возраст:", pets['мой питомец']['возраст'], "год.", "Имя владельца", pets['мой питомец']['владелец'], '.')

elif a == 2 or a == 12 or a == 22 or a == 32 or a == 42 or a == 52 or a == 62 or a == 72 or a == 82 or a == 92 or a == 102 or a == 3 or a == 13 or a == 23 or a == 33 or a == 43 or a == 53 or a == 63 or a == 73 or a == 83 or a == 93 or a == 103 or a == 4 or a == 14 or a == 24 or a == 34 or a == 44 or a == 54 or a == 64 or a == 74 or a == 84 or a == 94 or a == 104:
    print("Это", pets['мой питомец']['вид'], "по кличке", '"', pets['мой питомец']['кличка'], '".', "Возраст:", pets['мой питомец']['возраст'], "года.", "Имя владельца", pets['мой питомец']['владелец'], '.')

else:
    print("Это", pets['мой питомец']['вид'], "по кличке", '"', pets['мой питомец']['кличка'], '".', "Возраст:", pets['мой питомец']['возраст'], "лет.", "Имя владельца", pets['мой питомец']['владелец'], '.')